<script setup>
const items = [
  {
    text: 'AeroStore — магазин оригинальных и качественных товаров производства DJI и другой техники. Наш магазин существует на рынке более 10 лет, и за это время мы успели наладить продажу и поставку всего необходимого оборудования, а также качественный сервис по покупке нужной вам техники онлайн.'
  },
  {
    text: 'Мы гордимся своей принадлежностью к глобальной сети DJI — признанному мировому лидеру в области разработки и производства инновационных беспилотных летательных аппаратов. Наша миссия — предлагать клиентам передовые решения, объединяющие непревзойдённое качество и надёжность. В нашем ассортименте представлены сертифицированные дроны, подходящие как для профессионалов, так и для любителей, что позволяет каждому найти идеальное устройство для своих целей.'
  },
  {
    text: 'Мы осознаём актуальность вопросов безопасности в современном мире. Именно поэтому в нашем ассортименте представлены не только дроны, но и передовые системы защиты от квадрокоптеров. Эти решения созданы для надёжного обеспечения безопасности персонала, транспортных средств, зданий и инфраструктуры, эффективно нейтрализуя потенциальные воздушные угрозы.'
  },
  {
    text: 'Наша цель — стать надёжным партнёром для каждого клиента, предоставляя первоклассный сервис и поддержку на всех этапах: от подбора оптимального оборудования до его профессионального обслуживания. С нами вы можете быть уверены в том, что выбираете передовые и проверенные временем решения, соответствующие самым высоким стандартам качества.'
  }
]
</script>

<template>
  <div class="about-us">
    <div class="about-us__container">
      <h2 class="about-us__title">О НАС</h2>
      <div class="about-us__subtitle">
        <div class="about-us__subtitle-item" v-for="item in items">{{ item.text }}</div>
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
.about-us {
  width: 100%;
  color: transparent;
  display: flex;
  justify-content: center;
  align-items: center;
  padding: 90px 15px 24px 15px;

  &__container {
    max-width: 1166px;
    padding: 55px 0;
    display: flex;
    flex-direction: column;
    align-items: flex-start;
    justify-content: center;

    @media (max-width: 1165px) {
      padding: 0;
    }
  }

  &__title {
    font-family: 'Montserrat', sans-serif;
    font-size: 32px;
    font-weight: 700;
    margin-bottom: 13px;
    color: #000000;

    @media (max-width: 1165px) {
      font-size: 24px;
    }
  }

  &__subtitle {
    display: flex;
    flex-direction: column;
    gap: 16px;

    @media (max-width: 1165px) {
      font-size: 12px;
    }
  }

  &__subtitle-item {
    font-size: 14px;
    font-weight: 400;
    color: #000000;
  }
}
</style> 